Repository: thnhpht/flutter_nail
Catalog: app/lib/l10n/app_*.arb
Languages: ko, vi, zh

source: Salon
ko: 살롱
zh: 沙龙

# todayOverview
source: Today's Overview
ko: 오늘의 개요
vi: Tổng quan hôm nay
zh: 今日概览

source: Customers
ko: 고객
vi: Khách hàng
zh: 客户

source: Bills
ko: 청구서
vi: Hóa đơn
zh: 账单

source: Revenue
ko: 수익
vi: Doanh Thu
zh: 收入

source: Boss
ko: 사장
zh: 老板

source: Employee
ko: 직원
vi: Nhân viên
zh: 员工

source: Information
ko: 정보
vi: Thông tin
zh: 信息

# salonInfo
source: Information
ko: 정보
vi: Thông tin
zh: 信息

source: Menu
ko: 메뉴
zh: 菜单

source: Management
ko: 관리
vi: Quản lý
zh: 管理

source: Employees
ko: 직원
vi: Nhân viên
zh: 员工

source: Categories
ko: 카테고리
vi: Danh mục
zh: 分类

# services
source: Items
ko: 상품
vi: Chi tiết
zh: 商品

source: Create Order
ko: 주문 만들기
vi: Tạo đơn
zh: 创建订单

source: Bills & Reports
ko: 청구서 및 보고서
vi: Hóa đơn & Báo cáo
zh: 账单和报告

source: Reports
ko: 보고서
vi: Báo cáo
zh: 报告

source: Version
ko: 버전
vi: Phiên bản
zh: 版本

source: Logout
ko: 로그아웃
vi: Đăng xuất
zh: 退出登录

source: Loading...
ko: 로딩 중...
vi: Đang tải...
zh: 加载中...

# cannotLoadVersionInfo
source: Cannot load version information
ko: 버전 정보를 로드할 수 없습니다
vi: Không thể tải thông tin phiên bản
zh: 无法加载版本信息

source: Login
ko: 로그인
vi: Đăng nhập
zh: 登录

source: Username
ko: 사용자명
vi: Tên đăng nhập
zh: 用户名

source: Please enter username
ko: 사용자명을 입력해주세요
vi: Vui lòng nhập tên đăng nhập
zh: 请输入用户名

source: Password
ko: 비밀번호
vi: Mật khẩu
zh: 密码

# loginButton
source: Login
ko: 로그인
vi: Đăng nhập
zh: 登录

source: Login Error
ko: 로그인 오류
vi: Lỗi đăng nhập
zh: 登录错误

# invalidCredentials
source: Invalid username or password
ko: 사용자명 또는 비밀번호가 올바르지 않습니다
vi: Tên đăng nhập hoặc mật khẩu không đúng
zh: 用户名或密码不正确

source: Add
ko: 추가
vi: Thêm
zh: 添加

source: Edit
ko: 편집
vi: Sửa
zh: 编辑

source: Delete
ko: 삭제
vi: Xóa
zh: 删除

source: Save
ko: 저장
vi: Lưu
zh: 保存

source: Cancel
ko: 취소
vi: Hủy
zh: 取消

source: Confirm
ko: 확인
vi: Xác nhận
zh: 确认

source: Search
ko: 검색
vi: Tìm kiếm
zh: 搜索

source: Name
ko: 이름
vi: Tên
zh: 姓名

source: Phone
ko: 전화번호
vi: Số điện thoại
zh: 电话

source: Address
ko: 주소
vi: Địa chỉ
zh: 地址

source: Price
ko: 가격
vi: Giá
zh: 价格

source: Description
ko: 설명
vi: Mô tả
zh: 描述

source: Status
ko: 상태
vi: Trạng thái
zh: 状态

source: Date
ko: 날짜
vi: Ngày
zh: 日期

source: Time
ko: 시간
vi: Thời gian
zh: 时间

source: Total
ko: 총계
vi: Tổng
zh: 总计

source: Quantity
ko: 수량
vi: Số lượng
zh: 数量

source: Unit Price
ko: 단가
vi: Đơn giá
zh: 单价

source: Language
ko: 언어
vi: Ngôn ngữ
zh: 语言

source: Settings
ko: 설정
vi: Cài đặt
zh: 设置

source: Vietnamese
ko: 베트남어
vi: Tiếng Việt
zh: 越南语

source: English
ko: 영어
vi: Tiếng Anh
zh: 英语

source: Chinese
ko: 중국어
vi: Tiếng Trung
zh: 中文

source: Korean
ko: 한국어
vi: Tiếng Hàn
zh: 韩语

# roleSelection
source: Select Role
ko: 역할 선택
vi: Chọn vai trò
zh: 选择角色

source: Shop Owner
ko: 샵 오너
vi: Chủ salon
zh: 店主

source: Email
ko: 이메일
zh: 邮箱

source: Shop Name
ko: 매장 이름
vi: Tên Salon
zh: 店铺名称

source: Check Email
ko: 이메일 확인
vi: Kiểm tra email
zh: 检查邮箱

source: Email exists
ko: 이메일이 존재합니다
vi: Email đã tồn tại
zh: 邮箱已存在

source: Email not exists
ko: 이메일이 존재하지 않습니다
vi: Email chưa tồn tại
zh: 邮箱不存在

source: Create Account
ko: 계정 생성
vi: Tạo tài khoản
zh: 创建账户

source: Employee Login
ko: 직원 로그인
vi: Đăng nhập nhân viên
zh: 员工登录

source: Database Name
ko: 데이터베이스 이름
vi: Tên database
zh: 数据库名称

source: Phone Number
ko: 전화번호
vi: Số điện thoại
zh: 电话号码

source: Employee Phone
ko: 직원 전화번호
vi: Số điện thoại nhân viên
zh: 员工电话

source: Employee Password
ko: 직원 비밀번호
vi: Mật khẩu nhân viên
zh: 员工密码

source: Please enter email
ko: 이메일을 입력해주세요
vi: Vui lòng nhập email
zh: 请输入邮箱

source: Please enter shop name
ko: 샵 이름을 입력하세요
vi: Vui lòng nhập tên shop
zh: 请输入店铺名称

source: Please enter password
ko: 비밀번호를 입력해주세요
vi: Vui lòng nhập mật khẩu
zh: 请输入密码

# pleaseEnterPhone
source: Please enter phone number
ko: 전화번호를 입력해주세요
vi: Vui lòng nhập số điện thoại
zh: 请输入电话号码

source: Please enter name
ko: 이름을 입력하세요
vi: Vui lòng nhập tên
zh: 请输入姓名

source: Please enter database name
ko: 데이터베이스 이름을 입력하세요
vi: Vui lòng nhập tên database
zh: 请输入数据库名称

source: Invalid email
ko: 유효하지 않은 이메일
vi: Email không hợp lệ
zh: 无效邮箱

# passwordTooShort
source: Password must be at least 6 characters
ko: 비밀번호는 최소 6자 이상이어야 합니다
vi: Mật khẩu phải có ít nhất 6 ký tự
zh: 密码至少6个字符

# phoneTooShort
source: Phone must be at least 10 digits
ko: 전화번호는 최소 10자리 이상이어야 합니다
vi: Số điện thoại phải có ít nhất 10 số
zh: 电话号码至少10位

# databaseNameTooShort
source: Database name must be at least 3 characters
ko: 데이터베이스 이름은 최소 3자 이상이어야 합니다
vi: Tên database phải có ít nhất 3 ký tự
zh: 数据库名称至少3个字符

source: Checking email...
ko: 이메일 확인 중...
vi: Đang kiểm tra email...
zh: 正在检查邮箱...

source: Creating account...
ko: 계정 생성 중...
vi: Đang tạo tài khoản...
zh: 正在创建账户...

source: Logging in...
ko: 로그인 중...
vi: Đang đăng nhập...
zh: 正在登录...

source: Error checking email
ko: 이메일 확인 오류
vi: Lỗi kiểm tra email
zh: 检查邮箱时出错

source: Error creating account
ko: 계정 생성 오류
vi: Lỗi tạo tài khoản
zh: 创建账户时出错

source: Error logging in
ko: 로그인 오류
vi: Lỗi đăng nhập
zh: 登录时出错

source: Account created successfully
ko: 계정이 성공적으로 생성되었습니다
vi: Tài khoản đã được tạo thành công
zh: 账户创建成功

source: Login successful
ko: 로그인 성공
vi: Đăng nhập thành công
zh: 登录成功

source: Customer Name
ko: 고객 이름
vi: Tên khách hàng
zh: 客户姓名

source: Customer Phone
ko: 고객 전화번호
vi: Số điện thoại
zh: 客户电话

source: Customer Address
ko: 고객 주소
vi: Địa chỉ
zh: 客户地址

source: Add Customer
ko: 고객 추가
vi: Thêm khách hàng
zh: 添加客户

source: Edit Customer
ko: 고객 편집
vi: Sửa khách hàng
zh: 编辑客户

source: Delete Customer
ko: 고객 삭제
vi: Xóa khách hàng
zh: 删除客户

source: Customer added successfully
ko: 고객이 성공적으로 추가되었습니다
vi: Khách hàng đã được thêm thành công
zh: 客户添加成功

source: Customer updated successfully
ko: 고객이 성공적으로 업데이트되었습니다
vi: Khách hàng đã được cập nhật thành công
zh: 客户更新成功

source: Customer deleted successfully
ko: 고객이 성공적으로 삭제되었습니다
vi: Xóa khách hàng thành công
zh: 客户删除成功

source: Error adding customer
ko: 고객 추가 오류
vi: Lỗi thêm khách hàng
zh: 添加客户时出错

source: Error updating customer
ko: 고객 업데이트 오류
vi: Lỗi cập nhật khách hàng
zh: 更新客户时出错

source: Error deleting customer
ko: 고객 삭제 중 오류
vi: Lỗi khi xóa khách hàng
zh: 删除客户时出错

# confirmDeleteCustomer
source: Are you sure you want to delete this customer?
ko: 이 고객을 삭제하시겠습니까?
vi: Bạn có chắc chắn muốn xóa khách hàng này?
zh: 确定要删除此客户吗？

source: Employee Name
ko: 직원 이름
vi: Tên nhân viên
zh: 员工姓名

source: Employee Address
ko: 직원 주소
vi: Địa chỉ nhân viên
zh: 员工地址

# employeePosition
source: Position
ko: 직책
vi: Chức vụ
zh: 职位

# employeeSalary
source: Salary
ko: 급여
vi: Lương
zh: 工资

source: Add Employee
ko: 직원 추가
vi: Thêm nhân viên
zh: 添加员工

source: Edit Employee
ko: 직원 편집
vi: Sửa nhân viên
zh: 编辑员工

source: Delete Employee
ko: 직원 삭제
vi: Xóa nhân viên
zh: 删除员工

source: Employee added successfully
ko: 직원이 성공적으로 추가되었습니다
vi: Nhân viên đã được thêm thành công
zh: 员工添加成功

source: Employee updated successfully
ko: 직원이 성공적으로 업데이트되었습니다
vi: Nhân viên đã được cập nhật thành công
zh: 员工更新成功

source: Employee deleted successfully
ko: 직원이 성공적으로 삭제되었습니다
vi: Xóa nhân viên thành công
zh: 员工删除成功

source: Error adding employee
ko: 직원 추가 오류
vi: Lỗi thêm nhân viên
zh: 添加员工时出错

# errorUpdatingEmployee
source: Error updating employee information
ko: 직원 정보 업데이트 중 오류
vi: Lỗi thay đổi thông tin nhân viên
zh: 更新员工信息时出错

source: Error deleting employee
ko: 직원 삭제 중 오류
vi: Lỗi khi xóa nhân viên
zh: 删除员工时出错

# confirmDeleteEmployee
source: Are you sure you want to delete this employee?
ko: 이 직원을 삭제하시겠습니까?
vi: Bạn có chắc chắn muốn xóa nhân viên này?
zh: 确定要删除此员工吗？

source: Select Image
ko: 이미지 선택
vi: Chọn hình ảnh
zh: 选择图片

# cannotSelectImage
source: Cannot select image. Please check photo library access permissions and try again.
ko: 이미지를 선택할 수 없습니다. 사진 라이브러리 접근 권한을 확인하고 다시 시도하세요.
vi: Không thể chọn hình ảnh. Vui lòng kiểm tra quyền truy cập thư viện ảnh và thử lại.
zh: 无法选择图片。请检查照片库访问权限并重试。

source: Category Name
ko: 카테고리 이름
vi: Tên danh mục
zh: 分类名称

source: Add Category
ko: 카테고리 추가
vi: Thêm danh mục
zh: 添加分类

source: Edit Category
ko: 카테고리 편집
vi: Sửa danh mục
zh: 编辑分类

source: Delete Category
ko: 카테고리 삭제
vi: Xóa danh mục
zh: 删除分类

source: Category added successfully
ko: 카테고리가 성공적으로 추가되었습니다
vi: Danh mục đã được thêm thành công
zh: 分类添加成功

source: Category updated successfully
ko: 카테고리가 성공적으로 업데이트되었습니다
vi: Danh mục đã được cập nhật thành công
zh: 分类更新成功

source: Category deleted successfully
ko: 카테고리가 성공적으로 삭제되었습니다
vi: Xóa danh mục thành công
zh: 分类删除成功

source: Error adding category
ko: 카테고리 추가 오류
vi: Lỗi thêm danh mục
zh: 添加分类时出错

# errorUpdatingCategory
source: Error updating category information
ko: 카테고리 정보 업데이트 중 오류
vi: Lỗi thay đổi thông tin danh mục
zh: 更新分类信息时出错

source: Error deleting category
ko: 카테고리 삭제 중 오류
vi: Lỗi khi xóa danh mục
zh: 删除分类时出错

# confirmDeleteCategory
source: Are you sure you want to delete this category?
ko: 이 카테고리를 삭제하시겠습니까?
vi: Bạn có chắc chắn muốn xóa danh mục này?
zh: 确定要删除此分类吗？

# serviceName
source: Item Name
ko: 상품 이름
vi: Tên chi tiết
zh: 商品名称

source: Service Price
ko: 상품 가격
zh: 商品价格

source: Service Duration
ko: 상품 소요 시간
zh: 商品时长

source: Add Service
ko: 상품 추가
vi: Thêm chi tiết
zh: 添加商品

source: Edit Service
ko: 상품 편집
vi: Chỉnh sửa chi tiết
zh: 编辑商品

source: Delete Service
ko: 상품 삭제
vi: Xóa chi tiết
zh: 删除商品

# serviceAddedSuccessfully
source: Item added successfully
ko: 상품이 성공적으로 추가되었습니다
vi: Thêm chi tiết thành công
zh: 商品添加成功

# serviceUpdatedSuccessfully
source: Item updated successfully
ko: 상품이 성공적으로 업데되었습니다
vi: Cập nhật chi tiết thành công
zh: 商品更新成功

# serviceDeletedSuccessfully
source: Item deleted successfully
ko: 상품이 성공적으로 삭제되었습니다
vi: Xóa chi tiết thành công
zh: 商品删除成功

source: Error adding service
ko: 상품 추가 중 오류
vi: Lỗi khi thêm chi tiết
zh: 添加商品时出错

# errorUpdatingService
source: Error updating service information
ko: 상품 정보 업데이트 중 오류
vi: Lỗi khi thay đổi thông tin chi tiết
zh: 更新商品信息时出错

source: Error deleting service
ko: 상품 삭제 중 오류
vi: Lỗi khi xóa chi tiết
zh: 删除商品时出错

# confirmDeleteService
source: Are you sure you want to delete this service?
ko: 이 상품를 삭제하시겠습니까?
vi: Bạn có chắc chắn muốn xóa chi tiết này?
zh: 确定要删除此商品吗？

source: Order
ko: 주문
vi: Đơn hàng
zh: 订单

source: Orders
ko: 주문
vi: Đơn hàng
zh: 订单

source: Update Order
ko: 주문 업데이트
vi: Cập nhật đơn hàng
zh: 更新订单

source: Order created successfully!
ko: 주문이 성공적으로 생성되었습니다!
vi: Đã tạo đơn thành công!
zh: 订单创建成功！

source: Order updated successfully!
ko: 주문이 성공적으로 업데이트되었습니다!
vi: Đã cập nhật đơn thành công!
zh: 订单更新成功！

source: Order deleted successfully
ko: 주문이 성공적으로 삭제되었습니다
vi: Đơn hàng đã được xóa thành công
zh: 订单删除成功

# errorCreatingOrder
source: Error creating order: {error}
ko: 주문 생성 중 오류: {error}
vi: Lỗi tạo đơn: {error}
zh: 创建订单时出错：{error}

# errorUpdatingOrder
source: Error updating order: {error}
ko: 주문 업데이트 중 오류: {error}
vi: Lỗi cập nhật đơn: {error}
zh: 更新订单时出错：{error}

source: Error deleting order
ko: 주문 삭제 오류
vi: Lỗi xóa đơn hàng
zh: 删除订单时出错

# confirmDeleteOrder
source: Are you sure you want to delete this order?
ko: 이 주문을 삭제하시겠습니까?
vi: Bạn có chắc chắn muốn xóa đơn hàng này?
zh: 确定要删除此订单吗？

source: Select Employees
ko: 직원 선택
vi: Chọn nhân viên
zh: 选择员工

# selectedEmployees
source: employees selected
ko: 명 직원 선택됨
vi: nhân viên đã chọn
zh: 个员工已选择

# pleaseSelectAtLeastOneService
source: Please select at least one item
ko: 최소 하나의 상품를 선택하세요
vi: Vui lòng chọn ít nhất một chi tiết
zh: 请至少选择一个商品

source: Please select at least one employee
ko: 최소 한 명의 직원을 선택하세요
vi: Vui lòng chọn ít nhất một nhân viên
zh: 请至少选择一个员工

# canOnlyUpdateOrderToday
source: Can only update orders today
ko: 오늘의 주문만 업데이트할 수 있습니다
vi: Chỉ có thể cập nhật đơn hàng trong ngày hôm nay
zh: 只能更新今天的订单

source: Customer Information
ko: 고객 정보
vi: Thông tin khách hàng
zh: 客户信息

source: Employee Information
ko: 직원 정보
vi: Thông tin nhân viên
zh: 员工信息

# serviceCategories
source: Item Categories
ko: 상품 카테고리
vi: Danh mục chi tiết
zh: 商品分类

source: Performing Employee
ko: 담당 직원
vi: Nhân viên thực hiện
zh: 执行员工

source: Logged in employee
ko: 로그인한 직원
vi: Nhân viên đăng nhập
zh: 已登录员工

source: Found customer
ko: 고객을 찾았습니다
vi: Đã tìm thấy khách hàng
zh: 找到客户

# customerNotFound
source: Customer not found with this phone number. Please enter name to create new.
ko: 이 전화번호로 고객을 찾을 수 없습니다. 새로 만들려면 이름을 입력하세요.
vi: Không tìm thấy khách hàng với số điện thoại này. Vui lòng nhập tên để tạo mới.
zh: 未找到此电话号码的客户。请输入姓名以创建新客户。

source: Found employee
ko: 직원을 찾았습니다
vi: Đã tìm thấy nhân viên
zh: 找到员工

# employeeNotFound
source: Employee not found with this phone number. Please enter name to create new.
ko: 이 전화번호로 직원을 찾을 수 없습니다. 새로 만들려면 이름을 입력하세요.
vi: Không tìm thấy nhân viên với số điện thoại này. Vui lòng nhập tên để tạo mới.
zh: 未找到此电话号码的员工。请输入姓名以创建新员工。

# errorLoadingCategories
source: Error loading categories: {error}
ko: 카테고리 로딩 중 오류: {error}
vi: Lỗi tải danh mục: {error}
zh: 加载分类时出错：{error}

# errorLoadingServices
source: Error loading items
ko: 상품 로딩 중 오류: {error}
vi: Lỗi tải chi tiết: {error}
zh: 加载商品时出错：{error}

# errorLoadingEmployees
source: Error loading employees: {error}
ko: 직원 목록 로딩 중 오류: {error}
vi: Lỗi tải danh sách nhân viên: {error}
zh: 加载员工列表时出错：{error}

# errorSearchingCustomer
source: Error searching customer: {error}
ko: 고객 검색 중 오류: {error}
vi: Lỗi tìm kiếm khách hàng: {error}
zh: 搜索客户时出错：{error}

# errorSearchingEmployee
source: Error searching employee: {error}
ko: 직원 검색 중 오류: {error}
vi: Lỗi tìm kiếm nhân viên: {error}
zh: 搜索员工时出错：{error}

source: Invalid service data
ko: 유효하지 않은 상품 데이터
vi: Dữ liệu chi tiết không hợp lệ
zh: 无效的商品数据

source: Bill
ko: 청구서
vi: Hóa đơn
zh: 账单

source: Bill Number
ko: 청구서 번호
vi: Số hóa đơn
zh: 账单号

source: Bill Date
ko: 청구서 날짜
vi: Ngày hóa đơn
zh: 账单日期

source: Bill Total
ko: 청구서 총액
vi: Tổng hóa đơn
zh: 账单总额

source: Bill Status
ko: 청구서 상태
vi: Trạng thái hóa đơn
zh: 账单状态

source: Paid
ko: 결제 완료
vi: Đã thanh toán
zh: 已付款

source: Unpaid
ko: 미결제
vi: Chưa thanh toán
zh: 未付款

source: Pending
ko: 대기 중
vi: Đang chờ
zh: 待处理

source: Completed
ko: 완료
vi: Hoàn thành
zh: 已完成

source: Cancelled
ko: 취소됨
vi: Đã hủy
zh: 已取消

source: Report
ko: 보고서
vi: Báo cáo
zh: 报告

source: Daily Report
ko: 일일 보고서
vi: Báo cáo ngày
zh: 日报

source: Weekly Report
ko: 주간 보고서
vi: Báo cáo tuần
zh: 周报

source: Monthly Report
ko: 월간 보고서
vi: Báo cáo tháng
zh: 月报

source: Yearly Report
ko: 연간 보고서
vi: Báo cáo năm
zh: 年报

# totalRevenue
source: Total Revenue: {amount}
ko: 총 수익: {amount}
vi: Tổng doanh thu: {amount}
zh: 总收入: {amount}

# totalOrders
source: Total Orders: {count}
ko: 총 주문 수: {count}
vi: Tổng số hóa đơn: {count}
zh: 总订单数: {count}

source: Total Customers
ko: 총 고객 수
vi: Tổng khách hàng
zh: 总客户数

source: Average Order Value
ko: 평균 주문 가치
vi: Giá trị đơn hàng trung bình
zh: 平均订单价值

source: Salon Name
ko: 살롱 이름
vi: Tên salon
zh: 沙龙名称

source: Salon Address
ko: 살롱 주소
vi: Địa chỉ salon
zh: 沙龙地址

source: Salon Phone
ko: 살롱 전화번호
vi: Số điện thoại salon
zh: 沙龙电话

source: Salon Email
ko: 살롱 이메일
vi: Email salon
zh: 沙龙邮箱

source: Salon Description
ko: 살롱 설명
vi: Mô tả salon
zh: 沙龙描述

source: Salon Hours
ko: 영업 시간
vi: Giờ hoạt động
zh: 营业时间

source: Update Salon Info
ko: 살롱 정보 업데이트
vi: Cập nhật thông tin salon
zh: 更新沙龙信息

source: Salon info updated successfully
ko: 살롱 정보가 성공적으로 업데이트되었습니다
vi: Thông tin salon đã được cập nhật thành công
zh: 沙龙信息更新成功

source: Error updating salon info
ko: 살롱 정보 업데이트 오류
vi: Lỗi cập nhật thông tin salon
zh: 更新沙龙信息时出错

source: Notifications
ko: 알림
vi: Thông báo
zh: 通知

source: No notifications
ko: 알림 없음
vi: Không có thông báo
zh: 无通知

source: Mark as read
ko: 읽음으로 표시
vi: Đánh dấu đã đọc
zh: 标记为已读

source: Mark all as read
ko: 모두 읽음으로 표시
vi: Đánh dấu tất cả đã đọc
zh: 全部标记为已读

source: Clear all
ko: 모두 지우기
vi: Xóa tất cả
zh: 清除全部

source: minutes
ko: 분
vi: phút
zh: 分钟

source: hours
ko: 시간
vi: giờ
zh: 小时

source: days
ko: 일
vi: ngày
zh: 天

source: weeks
ko: 주
vi: tuần
zh: 周

source: months
ko: 월
vi: tháng
zh: 月

source: years
ko: 년
vi: năm
zh: 年

source: ago
ko: 전
vi: trước
zh: 前

source: now
ko: 지금
vi: bây giờ
zh: 现在

source: Today
ko: 오늘
vi: Hôm nay
zh: 今天

source: Yesterday
ko: 어제
vi: Hôm qua
zh: 昨天

source: tomorrow
ko: 내일
vi: ngày mai
zh: 明天

source: Clear Filter
ko: 필터 지우기
vi: Xóa bộ lọc
zh: 清除筛选

source: Apply
ko: 적용
vi: Áp dụng
zh: 应用

# chooseAction
source: Choose action for this {item}
ko: 이 {item}에 대한 작업 선택
vi: Chọn hành động cho {item} này
zh: 选择此{item}的操作

source: Try Again
ko: 다시 시도
vi: Thử lại
zh: 重试

# noItemsFound
source: No {item} found
ko: {item}을(를) 찾을 수 없습니다
vi: Không tìm thấy {item}
zh: 未找到{item}

source: Delete All Notifications
ko: 모든 알림 삭제
vi: Xóa tất cả thông báo
zh: 删除所有通知

# confirmDeleteAllNotifications
source: Are you sure you want to delete all notifications?
ko: 모든 알림을 삭제하시겠습니까?
vi: Bạn có chắc chắn muốn xóa tất cả thông báo?
zh: 您确定要删除所有通知吗？

source: Select QR Code
ko: QR 코드 선택
vi: Chọn QR Code
zh: 选择二维码

source: Change Logo
ko: 로고 변경
vi: Thay đổi logo
zh: 更改标志

source: All Employees
ko: 모든 직원
vi: Tất cả nhân viên
zh: 所有员工

source: All Customers
ko: 모든 고객
vi: Tất cả khách hàng
zh: 所有客户

source: All Statuses
ko: 모든 상태
vi: Tất cả trạng thái
zh: 所有状态

# errorLoadingData
source: Error loading data: {error}
ko: 데이터 로딩 오류: {error}
vi: Lỗi tải dữ liệu: {error}
zh: 加载数据错误：{error}

source: Add Image
ko: 이미지 추가
vi: Thêm ảnh
zh: 添加图片

# categoryFilter
source: Filter
ko: 필터
vi: Bộ lọc
zh: 筛选

# selectCategoriesToFilter
source: Select categories and sort
ko: 카테고리 선택 및 정렬
vi: Chọn danh mục và sắp xếp
zh: 选择分类并排序

# categoriesSelected
source: {count} categories selected
ko: {count}개 카테고리 선택됨
vi: {count} danh mục đã chọn
zh: 已选择 {count} 个类别

source: Selected Categories
ko: 선택된 카테고리
vi: Danh mục đã chọn
zh: 已选择的分类：

source: Remove All
ko: 모두 제거
vi: Xóa tất cả
zh: 移除全部

# allCategories
source: All Categories ({count})
ko: 모든 카테고리 ({count})
vi: Tất cả danh mục ({count})
zh: 所有分类（{count}）

source: Create New Service
ko: 새 네일 상품 만들기
vi: Tạo chi tiết mới
zh: 创建新的美甲商品

source: Please enter service name
ko: 상품 이름을 입력하세요
vi: Vui lòng nhập tên chi tiết
zh: 请输入商品名称

source: Please enter price
ko: 가격을 입력하세요
vi: Vui lòng nhập giá
zh: 请输入价格

source: Please enter valid price
ko: 유효한 가격을 입력하세요
vi: Vui lòng nhập giá hợp lệ
zh: 请输入有效价格

# errorUploadingImage
source: Error uploading image to server
ko: 서버에 이미지 업로드 중 오류
vi: Lỗi khi upload ảnh lên server
zh: 上传图片到商品器时出错

# updateServiceInfo
source: Update Service Information
ko: 상품 정보 업데이트
vi: Cập nhật thông tin chi tiết
zh: 更新商品信息

# categoryNameRequired
source: Category name is required
ko: 카테고리 이름은 필수입니다
vi: Tên danh mục không được để trống
zh: 分类名称不能为空

# employeePhoneExists
source: Employee phone number already exists
ko: 직원 전화번호가 이미 존재합니다
vi: SĐT của nhân viên đã được tạo
zh: 员工电话号码已存在

# customerPhoneExists
source: Customer phone number already exists
ko: 고객 전화번호가 이미 존재합니다
vi: SĐT của khách hàng đã được tạo
zh: 客户电话号码已存在

# errorUploadingLogo
source: Error uploading logo to server
ko: 서버에 로고 업로드 중 오류
vi: Lỗi khi upload logo lên server
zh: 上传标志到商品器时出错

# errorUploadingQRCode
source: Error uploading QR code to server
ko: 서버에 QR 코드 업로드 중 오류
vi: Lỗi khi upload QR code lên server
zh: 上传二维码到商品器时出错

# salonInfoSavedSuccessfully
source: Salon information saved successfully!
ko: 살롱 정보가 성공적으로 저장되었습니다!
vi: Lưu thông tin salon thành công!
zh: 沙龙信息保存成功！

source: Full Name
ko: 전체 이름
vi: Họ và tên
zh: 全名

source: Database Username
ko: 데이터베이스 사용자명
vi: Tên đăng nhập Database
zh: 数据库用户名

source: Database Password
ko: 데이터베이스 비밀번호
vi: Mật khẩu Database
zh: 数据库密码

source: VND
ko: 베트남 동
vi: VNĐ
zh: 越南盾

# hoursAgo
source: {hours} hours ago
ko: {hours}시간 전
vi: {hours} giờ trước
zh: {hours}小时前

# minutesAgo
source: {minutes} minutes ago
ko: {minutes}분 전
vi: {minutes} phút trước
zh: {minutes}分钟前

source: Just now
ko: 방금 전
vi: Vừa xong
zh: 刚刚

# enterNewCustomerInfo
source: Enter new customer information
ko: 새 고객 정보 입력
vi: Nhập thông tin khách hàng mới
zh: 输入新客户信息

# updateCustomerInfo
source: Update customer information
ko: 고객 정보 업데이트
vi: Cập nhật thông tin khách hàng
zh: 更新客户信息

# phoneLabel
source: Phone: {phone}
ko: 전화번호: {phone}
vi: SĐT: {phone}
zh: 电话: {phone}

source: customer
ko: 고객
vi: khách hàng
zh: 客户

# customersTitle
source: Customers
ko: 고객
vi: Khách hàng
zh: 客户

# manageCustomerInfo
source: Manage customer information
ko: 고객 정보 관리
vi: Quản lý thông tin khách hàng
zh: 管理客户信息

source: Search customers...
ko: 고객 검색...
vi: Tìm kiếm khách hàng...
zh: 搜索客户...

source: Error loading customer list
ko: 고객 목록 로딩 오류
vi: Lỗi tải danh sách khách hàng
zh: 加载客户列表时出错

source: Cannot load customer list
ko: 고객 목록을 불러올 수 없습니다
vi: Không thể tải danh sách khách hàng
zh: 无法加载客户列表

# checkNetworkOrTryAgain
source: Please check network connection or try again
ko: 네트워크 연결을 확인하거나 다시 시도해주세요
vi: Vui lòng kiểm tra kết nối mạng hoặc thử lại
zh: 请检查网络连接或重试

# enterNewEmployeeInfo
source: Enter new employee information
ko: 새 직원 정보 입력
vi: Nhập thông tin nhân viên mới
zh: 输入新员工信息

source: Please enter full name
ko: 전체 이름을 입력해주세요
vi: Vui lòng nhập họ và tên
zh: 请输入全名

source: Please enter phone number
ko: 전화번호를 입력하세요
vi: Vui lòng nhập số điện thoại
zh: 请输入电话号码

# errorUploadingImageToServer
source: Error uploading image to server: {error}
ko: 서버에 이미지 업로드 중 오류 발생: {error}
vi: Lỗi khi upload ảnh lên server: {error}
zh: 上传图片到商品器时出错：{error}

# updateEmployeeInfo
source: Update employee information
ko: 직원 정보 업데이트
vi: Cập nhật thông tin nhân viên
zh: 更新员工信息

# newPasswordOptional
source: New password (leave blank if not changing)
ko: 새 비밀번호 (변경하지 않으려면 비워두세요)
vi: Mật khẩu mới (để trống nếu không đổi)
zh: 新密码（不更改请留空）

# employeeInfoUpdatedSuccessfully
source: Employee information updated successfully
ko: 직원 정보가 성공적으로 업데이트되었습니다
vi: Thay đổi thông tin nhân viên thành công
zh: 员工信息更新成功

source: Manage salon employees
ko: 살롱 직원 관리
vi: Quản lý nhân viên salon
zh: 管理沙龙员工

source: Search employees...
ko: 직원 검색...
vi: Tìm kiếm nhân viên...
zh: 搜索员工...

source: Error loading employee list
ko: 직원 목록 로드 중 오류 발생
vi: Lỗi tải danh sách nhân viên
zh: 加载员工列表时出错

source: Cannot load employee list
ko: 직원 목록을 로드할 수 없습니다
vi: Không thể tải danh sách nhân viên
zh: 无法加载员工列表

# updateCategoryInfo
source: Update Category Information
ko: 카테고리 정보 업데이트
vi: Cập nhật thông tin danh mục
zh: 更新分类信息

# categoryInfoUpdatedSuccessfully
source: Category information updated successfully
ko: 카테고리 정보가 성공적으로 업데이트되었습니다
vi: Thay đổi thông tin danh mục thành công
zh: 分类信息更新成功

source: category
ko: 카테고리
vi: danh mục
zh: 分类

# categoriesTitle
source: Categories
ko: 카테고리
vi: Danh mục
zh: 分类

# categoriesListDescription
source: List of service categories
ko: 상품 카테고리 목록
vi: Danh sách danh mục chi tiết
zh: 商品分类列表

source: Search categories...
ko: 카테고리 검색...
vi: Tìm kiếm danh mục...
zh: 搜索分类...

source: Error loading categories list
ko: 카테고리 목록 로딩 중 오류 발생
vi: Lỗi tải danh sách danh mục
zh: 加载分类列表时出错

source: Cannot load categories list
ko: 카테고리 목록을 로드할 수 없습니다
vi: Không thể tải danh sách danh mục
zh: 无法加载分类列表

# checkNetworkOrTryAgainCategories
source: Please check network connection or try again
ko: 네트워크 연결을 확인하거나 다시 시도해주세요
vi: Vui lòng kiểm tra kết nối mạng hoặc thử lại
zh: 请检查网络连接或重试

# servicesTitle
source: Items
ko: 상품
vi: Chi tiết
zh: 商品

# servicesSubtitle
source: Manage items by category
ko: 카테고리별 상품 관리
vi: Quản lý chi tiết theo danh mục
zh: 按分类管理商品

# searchServices
source: Search items
ko: 상품 검색...
vi: Tìm kiếm chi tiết...
zh: 搜索商品...

# showingAllServices
source: Showing all {total} items
ko: 전체 {total}개 상품 표시
vi: Hiển thị tất cả {total} chi tiết
zh: 显示全部 {total} 个商品

# foundServicesWithCategoryAndSearch
source: Found {shown}/{total} items (filtered by category and search)
ko: {shown}/{total}개 상품 발견 (카테고리 및 검색으로 필터링됨)
vi: Tìm thấy {shown}/{total} chi tiết (lọc theo danh mục và tìm kiếm)
zh: 找到 {shown}/{total} 个商品（按分类和搜索筛选）

# foundServicesWithCategory
source: Found {shown}/{total} items (filtered by {count} categories)
ko: {shown}/{total}개 상품 발견 ({count}개 카테고리로 필터링됨)
vi: Tìm thấy {shown}/{total} chi tiết (lọc theo {count} danh mục)
zh: 找到 {shown}/{total} 个商品（按 {count} 个分类筛选）
