Repository: thnhpht/flutter_nail
Catalog: app/lib/l10n/app_*.arb
Languages: ko, vi, zh

# foundServicesWithSearch
source: Found {shown}/{total} items (search: "{search}")
ko: {shown}/{total}개 상품 발견 (검색: "{search}")
vi: Tìm thấy {shown}/{total} chi tiết (tìm kiếm: "{search}")
zh: 找到 {shown}/{total} 个商品（搜索："{search}"）

source: Clear Filters
ko: 필터 지우기
vi: Xóa bộ lọc
zh: 清除筛选

# errorLoadingServicesList
source: Error loading items list
ko: 상품 목록 로딩 오류
vi: Lỗi tải danh sách chi tiết
zh: 加载商品列表时出错

# cannotLoadServicesList
source: Cannot load items list
ko: 상품 목록을 불러올 수 없습니다
vi: Không thể tải danh sách chi tiết
zh: 无法加载商品列表

# checkNetworkOrTryAgainServices
source: Please check network connection or try again
ko: 네트워크 연결을 확인하거나 다시 시도해주세요
vi: Vui lòng kiểm tra kết nối mạng hoặc thử lại
zh: 请检查网络连接或重试

source: service
ko: 상품
zh: 商品

# customerFound
source: Customer found: {name}
ko: 고객을 찾았습니다: {name}
vi: Đã tìm thấy khách hàng: {name}
zh: 找到客户：{name}

# employeeFound
source: Employee found: {name}
ko: 직원을 찾았습니다: {name}
vi: Đã tìm thấy nhân viên: {name}
zh: 找到员工：{name}

source: Create New Order
ko: 새 주문 만들기
vi: Tạo đơn mới
zh: 创建新订单

# servicesSelected
source: {count} items selected
ko: {count}개의 상품 선택됨
vi: {count} chi tiết đã chọn
zh: {count} 个商品已选

source: Please enter customer name
ko: 고객 이름을 입력하세요
vi: Vui lòng nhập tên khách hàng
zh: 请输入客户姓名

source: Select Employee
ko: 직원 선택
vi: Chọn nhân viên
zh: 选择员工

source: Select Customer
ko: 고객 선택
vi: Chọn khách hàng
zh: 选择客户

# employeesSelected
source: {count} employees selected
ko: {count}명 직원 선택됨
vi: {count} nhân viên đã chọn
zh: 已选择 {count} 名员工

source: Select Category
ko: 카테고리 선택
vi: Chọn danh mục
zh: 选择类别

source: Select Service
ko: 상품 선택
vi: Chọn chi tiết
zh: 选择商品

# servicesSelectedCount
source: {count} items selected
ko: : {count}개의 상품 선택됨
vi: {count} chi tiết đã chọn
zh: {count} 个商品已选

source: Discount
ko: 할인
vi: Giảm giá
zh: 折扣

# discountMustBe0To100
source: Discount must be 0-100%
ko: 할인은 0-100%여야 합니다
vi: Giảm giá phải từ 0-100%
zh: 折扣必须在 0-100% 之间

# discountAmount
source: Discount: {amount} VND
ko: 할인: {amount}원
vi: Giảm giá: {amount} VNĐ
zh: 折扣：{amount} 元

source: Tip
ko: 팁
vi: Tiền bo
zh: 小费

source: Tip must be greater than 0
ko: 팁은 0보다 커야 합니다
vi: Tiền bo phải lớn hơn 0
zh: 小费必须大于 0

# tipAmount
source: Tip: {amount} VND
ko: 팁: {amount}원
vi: Tip: {amount} VNĐ
zh: 小费：{amount} 元

source: Tax
ko: 세금
vi: Thuế
zh: 税

# taxMustBe0To100
source: Tax must be between 0-100%
ko: 세금은 0-100% 사이여야 합니다
vi: Thuế phải từ 0-100%
zh: 税率必须在 0-100% 之间

# taxAmount
source: Tax: {amount} VND
ko: 세금: {amount}원
vi: Thuế: {amount} VNĐ
zh: 税：{amount} 元

# taxLabel
source: Tax
ko: 세금
vi: Thuế
zh: 税：

# taxAmountPositive
source: +{amount} VND
ko: +{amount}원
vi: +{amount} VNĐ
zh: +{amount} 元

source: Subtotal
ko: 소계
vi: Thành tiền
zh: 小计：

# subtotalAmount
source: {amount} VND
ko: {amount} 베트남 동
vi: {amount} VNĐ
zh: {amount} 越南盾

source: Discount ({percentage}%)
ko: 할인 ({percentage}%)
vi: Giảm giá ({percentage}%)
zh: 折扣（{percentage}%）：

# discountAmountNegative
source: -{amount} VND
ko: -{amount} 베트남 동
vi: -{amount} VNĐ
zh: -{amount} 越南盾

# tipLabel
source: Tip
ko: 팁
vi: Tiền bo
zh: 小费：

# tipAmountPositive
source: +{amount} VND
ko: +{amount} 베트남 동
vi: +{amount} VNĐ
zh: +{amount} 越南盾

source: Total Payment
ko: 총 결제금액
vi: Tổng thanh toán
zh: 总付款：

# totalPaymentAmount
source: {amount} VND
ko: {amount} 베트남 동
vi: {amount} VNĐ
zh: {amount} 越南盾

source: Refresh
ko: 새로고침
vi: Làm mới
zh: 刷新

source: Select
ko: 선택
vi: Chọn
zh: 选择

# cannotLoadSalonInfo
source: Cannot load salon information. Please check network connection and try again.
ko: 살롱 정보를 불러올 수 없습니다. 네트워크 연결을 확인하고 다시 시도해주세요.
vi: Không thể tải thông tin salon. Vui lòng kiểm tra kết nối mạng và thử lại.
zh: 无法加载沙龙信息。请检查网络连接并重试。

# cannotSaveSalonInfo
source: Cannot save salon information. Please check network connection and try again.
ko: 살롱 정보를 저장할 수 없습니다. 네트워크 연결을 확인하고 다시 시도해주세요.
vi: Không thể lưu thông tin salon. Vui lòng kiểm tra kết nối mạng và thử lại.
zh: 无法保存沙龙信息。请检查网络连接并重试。

source: Basic Information
ko: 기본 정보
vi: Thông tin cơ bản
zh: 基本信息

source: Social Media
ko: 소셜 미디어
vi: Mạng xã hội
zh: 社交媒体

# salonInformation
source: Information
ko: 정보
vi: Thông tin
zh: 信息

# manageSalonInfoAndContact
source: Manage information and contact
ko: 정보 및 연락처 관리
vi: Quản lý thông tin và liên hệ
zh: 管理信息和联系方式

source: QR Code
ko: QR 코드
zh: 二维码

# salonLogo
source: Logo
ko: 로고
zh: 标志

source: Select Logo
ko: 로고 선택
vi: Chọn Logo
zh: 选择标志

# salonNameLabel
source: Salon Name
ko: 살롱 이름
vi: Tên Salon
zh: 沙龙名称

# addressLabel
source: Address
ko: 주소
vi: Địa chỉ
zh: 地址

# phoneNumberLabel
source: Phone Number
ko: 전화번호
vi: Số điện thoại
zh: 电话号码

# emailLabel
source: Email
ko: 이메일
zh: 邮箱

# websiteLabel
source: Website
ko: 웹사이트
zh: 网站

# facebookLabel
source: Facebook
ko: 페이스북
zh: 脸书

source: Saving...
ko: 저장 중...
vi: Đang lưu...
zh: 保存中...

source: Save Information
ko: 정보 저장
vi: Lưu thông tin
zh: 保存信息

# menuTitle
source: Menu
ko: 메뉴
zh: 菜单

# menuSubtitle
source: Menu categories and items
ko: 메뉴 카테고리 및 상품
vi: Menu danh mục và chi tiết
zh: 菜单分类和商品

# searchServicesPlaceholder
source: Search items...
ko: 상품 검색...
vi: Tìm kiếm chi tiết...
zh: 搜索商品...

source: No categories yet
ko: 아직 카테고리가 없습니다
vi: Chưa có danh mục nào
zh: 暂无分类

# categoriesSection
source: Categories
ko: 카테고리
vi: Danh mục
zh: 分类

# servicesCount
source: {count} items
ko: {count}개 상품
vi: {count} chi tiết
zh: {count} 个商品

# categoriesCount
source: {count} categories
ko: {count}개 카테고리
vi: {count} danh mục
zh: {count}个分类

# servicesSection
source: Items
ko: 상품
vi: Chi tiết
zh: 商品

# viewAllServices
source: View all items
ko: 모든 상품 보기
vi: Xem tất cả chi tiết
zh: 查看所有商品

# noServicesFoundWithSearchAndCategory
source: No items "{search}" found in {category}
ko: "{search}"를 {category}에서 찾을 수 없습니다
vi: Không tìm thấy chi tiết "{search}" trong {category}
zh: 在{category}中未找到"{search}"

# noServicesFoundWithSearch
source: No items "{search}" found
ko: "{search}"를 찾을 수 없습니다
vi: Không tìm thấy chi tiết "{search}"
zh: 未找到"{search}"

# noServicesInCategory
source: Category "{category}" has no items
ko: "{category}" 카테고리에 아직 상품가 없습니다
vi: Danh mục "{category}" chưa có chi tiết nào
zh: "{category}"分类暂无商品

# noServicesYet
source: No items available
ko: 아직 상품가 없습니다
vi: Chưa có chi tiết nào
zh: 暂无商品

# unknownCategory
source: Unknown
ko: 알 수 없음
vi: Không xác định
zh: 未知

source: Bills Management
ko: 청구서 관리
vi: Quản lý hóa đơn
zh: 账单管理

source: Search bills...
ko: 청구서 검색...
vi: Tìm kiếm hóa đơn...
zh: 搜索账单...

source: Filter by Time
ko: 시간별 필터
vi: Lọc theo thời gian
zh: 按时间筛选

source: Select time range to view bills
ko: 청구서를 보기 위한 시간 범위 선택
vi: Chọn khoảng thời gian để xem hóa đơn
zh: 选择时间范围查看账单

source: Select custom time range
ko: 사용자 정의 시간 범위 선택
vi: Chọn khoảng thời gian tùy chỉnh
zh: 选择自定义时间范围

source: Select start and end date
ko: 시작 및 종료 날짜 선택
vi: Chọn ngày bắt đầu và kết thúc
zh: 选择开始和结束日期

source: Quick Select
ko: 빠른 선택
vi: Chọn nhanh
zh: 快速选择

source: Close
ko: 닫기
vi: Đóng
zh: 关闭

source: This Week
ko: 이번 주
vi: Tuần này
zh: 本周

source: This Month
ko: 이번 달
vi: Tháng này
zh: 本月

source: Last 30 Days
ko: 지난 30일
vi: 30 ngày qua
zh: 过去30天

# noBillsInTimeRange
source: No bills in this time range
ko: 이 시간 범위에 청구서가 없습니다
vi: Không có hóa đơn trong khoảng thời gian này
zh: 此时间范围内没有账单

source: No bills found
ko: 청구서를 찾을 수 없습니다
vi: Không tìm thấy hóa đơn
zh: 未找到账单

source: No bills yet
ko: 아직 청구서가 없습니다
vi: Chưa có hóa đơn nào
zh: 暂无账单

# noYourBillsInTimeRange
source: No bills of yours in this time range
ko: 이 시간 범위에 귀하의 청구서가 없습니다
vi: Không có hóa đơn của bạn trong khoảng thời gian này
zh: 此时间范围内没有您的账单

# noYourBillsFound
source: No bills of yours found
ko: 귀하의 청구서를 찾을 수 없습니다
vi: Không tìm thấy hóa đơn của bạn
zh: 未找到您的账单

# noYourBillsYet
source: You don't have any bills yet
ko: 아직 청구서가 없습니다
vi: Bạn chưa có hóa đơn nào
zh: 您还没有任何账单

# tryDifferentTimeRange
source: Try selecting a different time range or clear the time filter
ko: 다른 시간 범위를 선택하거나 시간 필터를 지우세요
vi: Thử chọn khoảng thời gian khác hoặc xóa bộ lọc thời gian
zh: 尝试选择不同的时间范围或清除时间筛选器

# tryDifferentSearch
source: Try searching with different keywords
ko: 다른 키워드로 검색해보세요
vi: Thử tìm kiếm với từ khóa khác
zh: 尝试使用不同的关键词搜索

# createFirstOrderToViewBills
source: Create your first order to view bills here
ko: 첫 번째 주문을 생성하여 여기서 청구서를 보세요
vi: Tạo đơn hàng đầu tiên để xem hóa đơn ở đây
zh: 创建第一个订单以在此处查看账单

# createFirstOrderToViewYourBills
source: Create your first order to view your bills here
ko: 첫 번째 주문을 생성하여 여기서 귀하의 청구서를 보세요
vi: Tạo đơn hàng đầu tiên để xem hóa đơn của bạn ở đây
zh: 创建第一个订单以在此处查看您的账单

source: filtered
ko: 필터됨
vi: đã lọc
zh: 已筛选

source: Total Amount
ko: 총 금액
vi: Tổng tiền
zh: 总金额

# noServices
source: No items
ko: 상품 없음
vi: Không có chi tiết
zh: 无商品

source: TEMPORARY
ko: 임시
vi: TẠM THỜI
zh: 临时

# cannotUpdateOrderTodayOnly
source: Can only update orders from today
ko: 오늘의 주문만 업데이트할 수 있습니다
vi: Chỉ có thể cập nhật đơn hàng trong ngày hôm nay
zh: 只能更新今天的订单

# serviceInfoNotFound
source: Item info not found for this order
ko: 이 주문에 대한 상품 정보를 찾을 수 없습니다
vi: Không tìm thấy thông tin chi tiết cho đơn hàng này
zh: 找不到此订单的商品信息

source: Select time range to view reports
ko: 보고서를 보기 위한 시간 범위 선택
vi: Chọn khoảng thời gian để xem báo cáo
zh: 选择时间范围查看报告

source: Revenue Reports
ko: 수익 보고서
vi: Báo Cáo Doanh Thu
zh: 收入报告

source: Statistics and revenue reports
ko: 통계 및 수익 보고서
vi: Thống kê và báo cáo doanh thu
zh: 统计和收入报告

# searchHint
source: Search...
ko: 검색...
vi: Tìm kiếm...
zh: 搜索...

source: Payment Status
ko: 결제 상태
vi: Trạng thái thanh toán
zh: 付款状态

source: Discount ({percent}%)
ko: 할인 ({percent}%)
vi: Giảm giá ({percent}%)
zh: 折扣（{percent}%）：

# noOrdersInTimeRange
source: No orders in this time range
ko: 이 시간 범위에 주문이 없습니다
vi: Không có hóa đơn trong khoảng thời gian này
zh: 此时间范围内没有订单

source: No orders found
ko: 주문을 찾을 수 없습니다
vi: Không tìm thấy hóa đơn
zh: 未找到订单

source: No orders yet
ko: 아직 주문이 없습니다
vi: Chưa có hóa đơn nào
zh: 暂无订单

# createFirstOrderToViewReports
source: Create your first order to view reports here
ko: 여기서 보고서를 보려면 첫 번째 주문을 만드세요
vi: Tạo hóa đơn đầu tiên để xem báo cáo ở đây
zh: 创建第一个订单以在此处查看报告

# billPaymentReceipt
source: Payment Receipt
ko: 결제 영수증
vi: Hóa đơn thanh toán
zh: 付款收据

source: Print
ko: 인쇄
vi: In
zh: 打印

source: Bill Code
ko: 청구서 코드
vi: Mã hóa đơn
zh: 账单代码

source: Created Date
ko: 생성일
vi: Ngày tạo
zh: 创建日期：

source: Serving Staff
ko: 상품 직원
vi: Nhân viên phục vụ
zh: 商品员工：

# serviceDetails
source: Item Details
ko: 상품 세부사항
vi: Chi tiết
zh: 商品详情

source: QR Code Payment
ko: QR 코드 결제
vi: QR Code thanh toán
zh: 二维码付款

# noQrCode
source: No QR Code Available
ko: QR 코드 없음
vi: Chưa có mã QR Code
zh: 暂无二维码

source: QR Code Display Error
ko: QR 코드 표시 오류
vi: Lỗi hiển thị QR Code
zh: 二维码显示错误

# scanQrToPay
source: Scan QR code to pay
ko: QR 코드를 스캔하여 결제
vi: Quét mã QR để thanh toán
zh: 扫描二维码付款

# serviceNotFoundError
source: Item not found error
ko: 상품을 찾을 수 없습니다
vi: Lỗi không tìm thấy chi tiết
zh: 找不到商品

# billFooter
source: Thank you for using our items!
ko: 저희 상품를 이용해 주셔서 감사합니다!
vi: Cảm ơn quý khách đã sử dụng chi tiết!
zh: 感谢您使用我们的商品！

# billFooter2
source: See you again!
ko: 다시 만나뵐 수 있기를 기대합니다!
vi: Hẹn gặp lại quý khách!
zh: 期待再次为您商品！

# canOnlyUpdateTodayOrders
source: Can only update orders from today
ko: 오늘 주문만 업데이트할 수 있습니다
vi: Chỉ có thể cập nhật đơn hàng trong ngày hôm nay
zh: 只能更新今天的订单

source: Order ID
ko: 주문 ID
vi: Mã hóa đơn
zh: 订单ID

source: Please enter order ID
ko: 주문 ID를 입력하세요
vi: Vui lòng nhập mã hóa đơn
zh: 请输入订单ID

# orderIdExists
source: Order ID already exists. Please enter a different ID.
ko: 주문 ID가 이미 존재합니다. 다른 ID를 입력하세요.
vi: Mã hóa đơn đã tồn tại. Vui lòng nhập mã khác.
zh: 订单ID已存在。请输入不同的ID。

source: Order ID (optional)
ko: 주문 ID (선택사항)
vi: Mã hóa đơn (tùy chọn)
zh: 订单ID（可选）

# customerPaidFully
source: Customer has paid in full
ko: 고객이 전액 결제했습니다
vi: Khách hàng đã thanh toán đầy đủ
zh: 客户已全额付款

# customerNotPaid
source: Customer has not paid
ko: 고객이 아직 결제하지 않았습니다
vi: Khách hàng chưa thanh toán
zh: 客户尚未付款

# totalPaymentLabel
source: Total Payment
ko: 총 결제금액
vi: Tổng thanh toán
zh: 总付款：

# orderNotFound
source: Order information not found
ko: 주문 정보를 찾을 수 없습니다
vi: Không tìm thấy thông tin đơn hàng
zh: 找不到订单信息

# errorLoadingOrder
source: Error loading order information: {error}
ko: 주문 정보 로드 중 오류: {error}
vi: Lỗi khi tải thông tin đơn hàng: {error}
zh: 加载订单信息时出错: {error}

# cannotConnectToServer
source: Cannot connect to server. Please check network connection.
ko: 서버에 연결할 수 없습니다. 네트워크 연결을 확인해주세요.
vi: Không thể kết nối đến máy chủ. Vui lòng kiểm tra kết nối mạng.
zh: 无法连接到商品器。请检查网络连接。

# notificationNoOrderInfo
source: Notification does not contain order information
ko: 알림에 주문 정보가 포함되어 있지 않습니다
vi: Thông báo không chứa thông tin đơn hàng
zh: 通知不包含订单信息

source: All notifications marked as read
ko: 모든 알림을 읽음으로 표시했습니다
vi: Đã đánh dấu tất cả thông báo là đã đọc
zh: 所有通知已标记为已读

source: Notification deleted
ko: 알림이 삭제되었습니다
vi: Đã xóa thông báo
zh: 通知已删除

# errorDeletingNotification
source: Error deleting notification: {error}
ko: 알림 삭제 중 오류: {error}
vi: Lỗi khi xóa thông báo: {error}
zh: 删除通知时出错: {error}

source: All notifications deleted
ko: 모든 알림이 삭제되었습니다
vi: Đã xóa tất cả thông báo
zh: 所有通知已删除

# errorDeletingAllNotifications
source: Error deleting all notifications: {error}
ko: 모든 알림 삭제 중 오류: {error}
vi: Lỗi khi xóa tất cả thông báo: {error}
zh: 删除所有通知时出错: {error}

# markAllAsReadTooltip
source: Mark all as read
ko: 모두 읽음으로 표시
vi: Đánh dấu tất cả đã đọc
zh: 全部标记为已读

# clearAllTooltip
source: Clear all
ko: 모두 지우기
vi: Xóa tất cả
zh: 清除全部

source: No notifications yet
ko: 아직 알림이 없습니다
vi: Chưa có thông báo nào
zh: 暂无通知

source: New notifications will appear here
ko: 새로운 알림이 여기에 나타납니다
vi: Các thông báo mới sẽ xuất hiện ở đây
zh: 新通知将在此处显示

# deleteAction
source: Delete
ko: 삭제
vi: Xóa
zh: 删除

# pdfErrorCreating
source: Error creating PDF: {error}
ko: PDF 생성 오류: {error}
vi: Lỗi tạo PDF: {error}
zh: 创建PDF时出错：{error}

# pdfErrorPluginNotSupported
source: Error: Plugin not supported on this platform. Please run on Android/iOS or install CocoaPods for macOS.
ko: 오류: 이 플랫폼에서 플러그인이 지원되지 않습니다. Android/iOS에서 실행하거나 macOS용 CocoaPods를 설치하세요.
vi: Lỗi: Plugin không được hỗ trợ trên platform này. Vui lòng chạy trên Android/iOS hoặc cài đặt CocoaPods cho macOS.
zh: 错误：此平台不支持插件。请在Android/iOS上运行或为macOS安装CocoaPods。

# pdfErrorSharingZalo
source: Error sharing to Zalo: {error}
ko: Zalo 공유 오류: {error}
vi: Lỗi chia sẻ Zalo: {error}
zh: 分享到Zalo时出错：{error}

# pdfErrorSharingFile
source: Error sharing file: {error}
ko: 파일 공유 오류: {error}
vi: Lỗi chia sẻ file: {error}
zh: 分享文件时出错：{error}

# pdfErrorCannotShare
source: Cannot share file: {error}
ko: 파일을 공유할 수 없습니다: {error}
vi: Không thể chia sẻ file: {error}
zh: 无法分享文件：{error}

# pdfErrorNoFileData
source: No PDF file or data available for sharing
ko: 공유할 PDF 파일이나 데이터가 없습니다
vi: Không có file PDF hoặc dữ liệu để chia sẻ
zh: 没有可分享的PDF文件或数据

# pdfErrorNoFileToShare
source: No PDF file available for sharing
ko: 공유할 PDF 파일이 없습니다
vi: Không có file PDF để chia sẻ
zh: 没有可分享的PDF文件

# pdfZaloOpened
source: Zalo opened! Please select Zalo in the share menu to send the bill.
ko: Zalo가 열렸습니다! 청구서를 보내려면 공유 메뉴에서 Zalo를 선택하세요.
vi: Zalo đã mở! Vui lòng chọn Zalo trong menu chia sẻ để gửi hóa đơn.
zh: Zalo已打开！请在分享菜单中选择Zalo来发送账单。

# pdfBillFrom
source: Bill from {salonName}
ko: {salonName}의 청구서
vi: Hóa đơn từ {salonName}
zh: 来自{salonName}的账单

# pdfFileCreatedManualShare
source: PDF file created. Please share manually.
ko: PDF 파일이 생성되었습니다. 수동으로 공유하세요.
vi: File PDF đã được tạo. Vui lòng chia sẻ thủ công.
zh: PDF文件已创建。请手动分享。

# pdfPhoneNumber
source: Phone: {phoneNumber}
ko: 전화: {phoneNumber}
vi: Số điện thoại: {phoneNumber}
zh: 电话：{phoneNumber}

# pdfBillInfoTitle
source: BILL INFORMATION
ko: 청구서 정보
vi: THÔNG TIN HÓA ĐƠN
zh: 账单信息

# pdfBillCode
source: Bill Code
ko: 청구서 번호
vi: Mã hóa đơn
zh: 账单编号：

# pdfCreatedDate
source: Created Date
ko: 생성일
vi: Ngày tạo
zh: 创建日期：

# pdfCustomerInfoTitle
source: CUSTOMER INFORMATION
ko: 고객 정보
vi: THÔNG TIN KHÁCH HÀNG
zh: 客户信息

# pdfCustomerName
source: Customer Name
ko: 고객명
vi: Tên khách hàng
zh: 客户姓名：

# pdfCustomerPhone
source: Phone Number
ko: 전화번호
vi: Số điện thoại
zh: 电话号码：

# pdfEmployeeServed
source: Employee Served
ko: 담당 직원
vi: Nhân viên phục vụ
zh: 商品员工：

# pdfServicesDetailTitle
source: ITEM DETAILS
ko: 상품 상세
vi: CHI TIẾT
zh: 商品详情

# pdfPaymentInfoTitle
source: Payment Information
ko: 결제 정보
vi: THÔNG TIN THANH TOÁN
zh: 付款信息

# pdfSubtotal
source: Subtotal
ko: 소계
vi: Thành tiền
zh: 小计：

# pdfDiscount
source: Discount ({percent}%)
ko: 할인 ({percent}%)
vi: Giảm giá ({percent}%)
zh: 折扣（{percent}%）：

# pdfTip
source: Tip
ko: 팁
vi: Tiền bo
zh: 小费：

# pdfTotalPayment
source: Total Payment
ko: 총 결제금액
vi: TỔNG THANH TOÁN
zh: 总付款：

# pdfThankYouMessage
source: Thank you for using our service!
ko: 상품를 이용해 주셔서 감사합니다!
vi: Cảm ơn quý khách đã sử dụng chi tiết!
zh: 感谢您使用我们的商品！

# pdfSeeYouAgainMessage
source: See you again!
ko: 다시 만나요!
vi: Hẹn gặp lại quý khách!
zh: 期待再次为您商品！

# pdfShareBillTitle
source: Share Bill
ko: 청구서 공유
vi: Chia sẻ hóa đơn
zh: 分享账单

# pdfShareBillMessage
source: Choose how to share the bill
ko: 청구서 공유 방법을 선택하세요
vi: Chọn cách chia sẻ hóa đơn
zh: 选择分享账单的方式：

# pdfShareOther
source: Other
ko: 기타
vi: Khác
zh: 其他

# pdfCancel
source: Cancel
ko: 취소
vi: Hủy
zh: 取消

# pdfFileCreatedTitle
source: PDF File Created
ko: PDF 파일 생성됨
vi: File PDF đã được tạo
zh: PDF文件已创建

# pdfFileCreatedSuccess
source: PDF file created successfully!
ko: PDF 파일이 성공적으로 생성되었습니다!
vi: File PDF đã được tạo thành công!
zh: PDF文件创建成功！

# pdfFilePath
source: Path: {filePath}
ko: 경로: {filePath}
vi: Đường dẫn: {filePath}
zh: 路径：{filePath}

# pdfYouCanDo
source: You can
ko: 다음을 할 수 있습니다
vi: Bạn có thể
zh: 您可以：

# pdfOpenWithApp
source: • Open file with PDF app
ko: • PDF 앱으로 파일 열기
vi: • Mở file bằng ứng dụng PDF
zh: • 使用PDF应用打开文件

# pdfShareManually
source: • Share file manually
ko: • 파일 수동 공유
vi: • Chia sẻ file thủ công
zh: • 手动分享文件

# pdfSendViaEmail
source: • Send via email
ko: • 이메일로 전송
vi: • Gửi qua email
zh: • 通过邮件发送

# pdfClose
source: Close
ko: 닫기
vi: Đóng
zh: 关闭

# pdfOpenFile
source: Open File
ko: 파일 열기
vi: Mở file
zh: 打开文件

# pdfPathCopiedToClipboard
source: File path copied to clipboard: {filePath}
ko: 파일 경로가 클립보드에 복사되었습니다: {filePath}
vi: Đã copy đường dẫn file vào clipboard: {filePath}
zh: 文件路径已复制到剪贴板：{filePath}

# pdfTemporaryBillId
source: TEMPORARY
ko: 임시
vi: TẠM THỜI
zh: 临时

source: Select account type to continue
ko: 계속하려면 계정 유형을 선택하세요
vi: Chọn loại tài khoản để tiếp tục
zh: 选择账户类型以继续

source: Connect
ko: 연결
vi: Kết nối
zh: 连接

source: Enter email to check account
ko: 계정을 확인하려면 이메일을 입력하세요
vi: Nhập email để kiểm tra tài khoản
zh: 输入邮箱以检查账户

source: Enter shop name to check account
ko: 계정을 확인하려면 샵 이름을 입력하세요
vi: Nhập tên shop để kiểm tra tài khoản
zh: 输入店铺名称以检查账户

source: Enter password to login
ko: 로그인하려면 비밀번호를 입력하세요
vi: Nhập mật khẩu để đăng nhập
zh: 输入密码以登录

source: Create new account for
ko: 새 계정 만들기
vi: Tạo tài khoản mới cho
zh: 为新账户创建

source: Create new account
ko: 새 계정 만들기
vi: Tạo tài khoản mới
zh: 创建新账户

# enterEmployeeLoginInfo
source: Enter employee login information
ko: 직원 로그인 정보를 입력하세요
vi: Nhập thông tin đăng nhập nhân viên
zh: 输入员工登录信息

# continueText
source: Continue
ko: 계속
vi: Tiếp tục
zh: 继续

source: Manage entire system
ko: 전체 시스템 관리
vi: Quản lý toàn bộ hệ thống
zh: 管理整个系统

# accessServicesCreateOrdersAndBills
source: Access items, create orders and bills
ko: 상품 접근, 주문 및 청구서 생성
vi: Truy cập chi tiết, tạo đơn và hóa đơn
zh: 访问商品，创建订单和账单

source: Please enter your email
ko: 이메일을 입력해주세요
vi: Vui lòng nhập email của bạn
zh: 请输入您的邮箱

# invalidEmailExample
source: Invalid email (example: example@email.com)
ko: 유효하지 않은 이메일 (예: example@email.com)
vi: Email không hợp lệ (ví dụ: example@email.com)
zh: 无效邮箱（例如：example@email.com）

source: Invalid email (missing domain)
ko: 유효하지 않은 이메일 (도메인 누락)
vi: Email không hợp lệ (thiếu domain)
zh: 无效邮箱（缺少域名）

# emailExistsInSystem
source: Email already exists in system
ko: 이메일이 시스템에 이미 존재합니다
vi: Email đã tồn tại trong hệ thống
zh: 邮箱在系统中已存在

# emailNotExistsWillCreateNew
source: Email does not exist, will create new account
ko: 이메일이 존재하지 않습니다. 새 계정을 생성합니다
vi: Email chưa tồn tại, sẽ tạo tài khoản mới
zh: 邮箱不存在，将创建新账户

# pleaseEnterPasswordValidation
source: Please enter password
ko: 비밀번호를 입력해주세요
vi: Vui lòng nhập mật khẩu
zh: 请输入密码

# passwordMinLength
source: Password must be at least 8 characters
ko: 비밀번호는 최소 8자 이상이어야 합니다
vi: Mật khẩu phải có ít nhất 8 ký tự
zh: 密码必须至少8个字符

# passwordMustHaveUppercase
source: Password must have at least 1 uppercase letter (A-Z)
ko: 비밀번호는 최소 1개의 대문자(A-Z)가 있어야 합니다
vi: Mật khẩu phải có ít nhất 1 chữ hoa (A-Z)
zh: 密码必须至少包含1个大写字母（A-Z）

# passwordMustHaveLowercase
source: Password must have at least 1 lowercase letter (a-z)
ko: 비밀번호는 최소 1개의 소문자(a-z)가 있어야 합니다
vi: Mật khẩu phải có ít nhất 1 chữ thường (a-z)
zh: 密码必须至少包含1个小写字母（a-z）

# passwordMustHaveNumber
source: Password must have at least 1 number (0-9)
ko: 비밀번호는 최소 1개의 숫자(0-9)가 있어야 합니다
vi: Mật khẩu phải có ít nhất 1 số (0-9)
zh: 密码必须至少包含1个数字（0-9）

# passwordMustHaveSpecialChar
source: Password must have at least 1 special character
ko: 비밀번호는 최소 1개의 특수문자가 있어야 합니다
vi: Mật khẩu phải có ít nhất 1 ký tự đặc biệt
zh: 密码必须至少包含1个特殊字符

source: Database
ko: 데이터베이스
zh: 数据库

source: Database Login Username
ko: 데이터베이스 로그인 사용자명
vi: Tên đăng nhập Database
zh: 数据库登录用户名

source: Please enter database username
ko: 데이터베이스 사용자명을 입력해주세요
vi: Vui lòng nhập tên đăng nhập database
zh: 请输入数据库用户名

source: Please enter database password
ko: 데이터베이스 비밀번호를 입력해주세요
vi: Vui lòng nhập mật khẩu database
zh: 请输入数据库密码

# databasePasswordMinLength
source: Database password must be at least 8 characters
ko: 데이터베이스 비밀번호는 최소 8자 이상이어야 합니다
vi: Mật khẩu database phải có ít nhất 8 ký tự
zh: 数据库密码必须至少8个字符

# databasePasswordMustHaveUppercase
source: Database password must have at least 1 uppercase letter (A-Z)
ko: 데이터베이스 비밀번호는 최소 1개의 대문자(A-Z)가 있어야 합니다
vi: Mật khẩu database phải có ít nhất 1 chữ hoa (A-Z)
zh: 数据库密码必须至少包含1个大写字母（A-Z）

# databasePasswordMustHaveLowercase
source: Database password must have at least 1 lowercase letter (a-z)
ko: 데이터베이스 비밀번호는 최소 1개의 소문자(a-z)가 있어야 합니다
vi: Mật khẩu database phải có ít nhất 1 chữ thường (a-z)
zh: 数据库密码必须至少包含1个小写字母（a-z）

# databasePasswordMustHaveNumber
source: Database password must have at least 1 number (0-9)
ko: 데이터베이스 비밀번호는 최소 1개의 숫자(0-9)가 있어야 합니다
vi: Mật khẩu database phải có ít nhất 1 số (0-9)
zh: 数据库密码必须至少包含1个数字（0-9）

# databasePasswordMustHaveSpecialChar
source: Database password must have at least 1 special character
ko: 데이터베이스 비밀번호는 최소 1개의 특수문자가 있어야 합니다
vi: Mật khẩu database phải có ít nhất 1 ký tự đặc biệt
zh: 数据库密码必须至少包含1个特殊字符

source: Welcome back
ko: 다시 오신 것을 환영합니다
vi: Chào mừng quay trở lại
zh: 欢迎回来

# passwordIncorrect
source: Password is incorrect. Please check again.
ko: 비밀번호가 올바르지 않습니다. 다시 확인해주세요.
vi: Mật khẩu không chính xác. Vui lòng kiểm tra lại.
zh: 密码不正确。请重新检查。

# databaseLoginInfoIncorrect
source: Database login information is incorrect. Please check again.
ko: 데이터베이스 로그인 정보가 올바르지 않습니다. 다시 확인해주세요.
vi: Thông tin đăng nhập database không chính xác. Vui lòng kiểm tra lại.
zh: 数据库登录信息不正确。请重新检查。

# databaseUsernameIncorrect
source: Database username is incorrect.
ko: 데이터베이스 사용자명이 올바르지 않습니다.
vi: Tên đăng nhập database không chính xác.
zh: 数据库用户名不正确。

# databasePasswordIncorrect
source: Database password is incorrect.
ko: 데이터베이스 비밀번호가 올바르지 않습니다.
vi: Mật khẩu database không chính xác.
zh: 数据库密码不正确。

# accountCreatedButDatabaseError
source: Account created successfully but cannot create database. Please contact admin.
ko: 계정이 성공적으로 생성되었지만 데이터베이스를 생성할 수 없습니다. 관리자에게 문의하세요.
vi: Tạo tài khoản thành công nhưng không thể tạo database. Vui lòng liên hệ admin.
zh: 账户创建成功但无法创建数据库。请联系管理员。
