Repository: thnhpht/flutter_nail
Catalog: app/lib/l10n/app_*.arb
Languages: ko, vi, zh

# databasePasswordNotStrongEnough
source: Database password is not strong enough. Please check requirements below.
ko: 데이터베이스 비밀번호가 충분히 강력하지 않습니다. 아래 요구사항을 확인해주세요.
vi: Mật khẩu database không đủ mạnh. Vui lòng kiểm tra yêu cầu bên dưới.
zh: 数据库密码强度不够。请检查下面的要求。

# loginInfoIncorrect
source: Login information is incorrect. Please check again.
ko: 로그인 정보가 올바르지 않습니다. 다시 확인해주세요.
vi: Thông tin đăng nhập không chính xác. Vui lòng kiểm tra lại.
zh: 登录信息不正确。请重新检查。

# systemErrorOccurred
source: System error occurred. Please try again later.
ko: 시스템 오류가 발생했습니다. 나중에 다시 시도해주세요.
vi: Đã xảy ra lỗi hệ thống. Vui lòng thử lại sau.
zh: 发生系统错误。请稍后重试。

# connectionTimeout
source: Connection timeout. Please try again.
ko: 연결 시간 초과. 다시 시도해주세요.
vi: Kết nối bị timeout. Vui lòng thử lại.
zh: 连接超时。请重试。

# networkConnectionError
source: Network connection error. Please check internet connection.
ko: 네트워크 연결 오류. 인터넷 연결을 확인해주세요.
vi: Lỗi kết nối mạng. Vui lòng kiểm tra kết nối internet.
zh: 网络连接错误。请检查互联网连接。

# errorOccurredPleaseTryAgain
source: Error occurred. Please try again later.
ko: 오류가 발생했습니다. 나중에 다시 시도해주세요.
vi: Đã xảy ra lỗi. Vui lòng thử lại sau.
zh: 发生错误。请稍后重试。

source: Code
ko: 코드
vi: Mã số
zh: 编号

source: Unit
ko: 단위
vi: Đơn vị
zh: 单位

source: Service Code
ko: 상품 코드
zh: 商品编号

source: Unit of Measurement
ko: 측정 단위
vi: Đơn vị tính
zh: 计量单位

source: Sort By
ko: 정렬 기준
vi: Sắp xếp theo
zh: 排序方式

# sortNewestFirst
source: Newest
ko: 최신
vi: Mới nhất
zh: 最新

# sortOldestFirst
source: Oldest
ko: 오래된 것
vi: Cũ nhất
zh: 最旧

# sortPriceHighToLow
source: Price: High to Low
ko: 가격: 높은 것부터 낮은 것까지
vi: Giá: Cao đến thấp
zh: 价格：高到低

# sortPriceLowToHigh
source: Price: Low to High
ko: 가격: 낮은 것부터 높은 것까지
vi: Giá: Thấp đến cao
zh: 价格：低到高

source: Apply Sorting
ko: 정렬 적용
vi: Áp dụng sắp xếp
zh: 应用排序

source: Clear Sorting
ko: 정렬 초기화
vi: Xóa sắp xếp
zh: 清除排序

source: Items
ko: 상품
vi: Chi tiết
zh: 商品

source: Item Name
ko: 상품 이름
vi: Tên chi tiết
zh: 商品名称

source: Item Price
ko: 상품 가격
vi: Giá chi tiết
zh: 商品价格

source: Item Duration
ko: 상품 소요 시간
vi: Thời gian thực hiện
zh: 商品用时

source: Item added successfully
ko: 상품이 성공적으로 추가되었습니다
vi: Thêm chi tiết thành công
zh: 商品添加成功

source: Item updated successfully
ko: 상품이 성공적으로 업데이트되었습니다
vi: Thay đổi thông tin chi tiết thành công
zh: 商品更新成功

source: Item deleted successfully
vi: Xóa chi tiết thành công
zh: 商品删除成功

source: Item Categories
ko: 상품 카테고리
vi: Danh mục chi tiết
zh: 商品分类

# itemsTitle
source: Items
ko: 상품
vi: Chi tiết
zh: 商品

# itemsSubtitle
source: Manage items by category
ko: 카테고리별 상품 관리
vi: Quản lý chi tiết theo danh mục
zh: 按分类管理商品

source: item
ko: 상품
vi: chi tiết
zh: 商品

# itemsSelected
source: {count} items selected
ko: 선택된 상품
vi: {count} chi tiết đã chọn
zh: 已选商品

# itemsSelectedCount
source: {count} items selected
ko: {count}개 상품 선택됨
vi: {count} chi tiết đã chọn
zh: 已选 {count} 个商品

# itemsCount
source: {count} items
ko: {count}개 상품
vi: {count} chi tiết
zh: {count} 个商品

# itemsSection
source: Items
ko: 상품
vi: Chi tiết
zh: 商品

# itemInfoNotFound
source: Item info not found for this order
ko: 이 주문에 대한 상품 정보를 찾을 수 없습니다
vi: Không tìm thấy thông tin chi tiết cho đơn hàng này
zh: 找不到此订单的商品信息

source: Item Details
ko: 상품 세부사항
vi: Chi tiết
zh: 商品详情

source: Item not found error
ko: 상품을 찾을 수 없습니다
vi: Không tìm thấy thông tin chi tiết cho đơn hàng này
zh: 找不到商品

source: Item Code
ko: 상품 코드
vi: Mã chi tiết
zh: 商品代码

# pdfDownloadSuccess
source: Downloaded successfully: {fileName}
ko: 다운로드 성공: {fileName}
vi: Đã tải xuống thành công: {fileName}
zh: 下载成功: {fileName}

# pdfErrorDownloadingWeb
source: Error downloading PDF on web: {error}
ko: 웹에서 PDF 다운로드 오류: {error}
vi: Lỗi khi tải PDF trên web: {error}
zh: 网页下载PDF错误: {error}

source: Shipping Fee
ko: 배송비
vi: Phí ship
zh: 运费

# shippingFeeMustBeGreaterThan0
source: Shipping fee must be greater than or equal to 0
ko: 배송비는 0 이상이어야 합니다
vi: Phí ship phải lớn hơn hoặc bằng 0
zh: 运费必须大于或等于0

# shippingFeeAmount
source: Shipping Fee: {amount} VND
ko: 배송비: {amount} VND
vi: Phí ship: {amount} VNĐ
zh: 运费: {amount} VND

# shippingFeeLabel
source: Shipping Fee
ko: 배송비
vi: Phí ship
zh: 运费

source: Export Reports
ko: 보고서 내보내기
vi: Xuất báo cáo
zh: 导出报告

source: Export Reports to PDF
ko: PDF로 보고서 내보내기
vi: Xuất báo cáo ra PDF
zh: 导出报告为PDF

source: Exporting reports...
ko: 보고서 내보내는 중...
vi: Đang xuất báo cáo...
zh: 正在导出报告...

# exportReportsSuccess
source: Reports exported successfully
ko: 보고서 내보내기 성공
vi: Xuất báo cáo thành công
zh: 报告导出成功

# exportReportsError
source: Error exporting reports: {error}
ko: 보고서 내보내기 오류: {error}
vi: Lỗi khi xuất báo cáo: {error}
zh: 导出报告错误: {error}

# reportsPDFTitle
source: Revenue Reports
ko: 수익 보고서
vi: Báo cáo doanh thu
zh: 收入报告

# exportedOn
source: Exported on: {date}
ko: 내보낸 날짜: {date}
vi: Xuất ngày: {date}
zh: 导出日期: {date}

source: No orders to export
ko: 내보낼 주문이 없습니다
vi: Không có hóa đơn để xuất
zh: 没有订单可导出

source: Summary
ko: 요약
vi: Tóm tắt
zh: 摘要

source: Export Date
ko: 내보낸 날짜
vi: Ngày xuất
zh: 导出日期

source: Bill Information
vi: Thông tin hoá đơn
zh: 账单信息

source: Contact
vi: Liên hệ
zh: 联系方式

source: Thank You Message
vi: Lời cảm ơn
zh: 感谢信息

# pdfContactInfoTitle
source: Contact for Ordering
vi: Liên hệ đặt món
zh: 订餐联系

# pdfPhoneLabel
source: Phone:
zh: 电话：

# pdfAddressLabel
source: Address:
zh: 地址：

# pdfSerialNumberHeader
source: No.
zh: 序号

# pdfProductNameHeader
source: Product Name
zh: 商品名称

# pdfQuantityHeader
source: Quantity
zh: 数量

# pdfUnitPriceHeader
source: Unit Price
zh: 单价

# pdfTotalAmountHeader
source: Total
zh: 金额

# pdfContactHeader
source: Contact
zh: 联系

# pdfDefaultThankYouMessage
source: Dear valued customers! We sincerely thank you for your continued support of HTB Kitchen. We will do our best to bring you wholesome and nutritious meals. Best regards...
zh: 尊敬的客户您好！感谢您对HTB厨房的大力支持。我们将竭尽全力为您提供新鲜美味的餐食。祝您用餐愉快...

# pleaseSelectAtLeastOneCategory
source: Please select at least 1 category
zh: 请至少选择1个分类

source: Booking
zh: 预约

source: Booking User
zh: 预约用户

# bookingDescription
source: Book services at salons
zh: 在沙龙预约服务

source: Enter salon name
zh: 输入沙龙名称

source: Connect to Salon
zh: 连接到沙龙

source: Connecting...
zh: 连接中...

source: Connection successful!
zh: 连接成功！

source: Connection failed
zh: 连接失败

source: Salon not found
zh: 未找到沙龙

source: Please enter salon name
zh: 请输入沙龙名称

source: Delivery Option
zh: 配送选项

source: Home Delivery
zh: 送货上门

source: Pickup at Salon
zh: 到店自取

source: Select delivery option
zh: 请选择配送选项

source: Booking successful!
zh: 预约成功！

source: Booking failed
zh: 预约失败

source: Create Booking
zh: 创建预约

source: Booking Details
zh: 预约详情

source: Booking ID
zh: 预约ID

source: Booking Date
zh: 预约日期

source: Delivery Method
zh: 配送方式

source: Booking Total
zh: 预约总额

# thankYouForBooking
source: Thank you for your booking!
zh: 感谢您的预约！

source: Booking Confirmation
zh: 预约确认

source: Your booking has been confirmed
zh: 您的预约已确认

source: Booking Reference
zh: 预约参考号

source: Estimated Time
zh: 预计时间

source: Contact Salon
zh: 联系沙龙

source: Back to Menu
zh: 返回菜单

source: New Booking
zh: 新预约

# bookingScreenTitle
source: Booking
zh: 预约

# bookingButton
source: Booking
zh: 预约

# bookingScreenDetails
source: Booking Details
zh: 预约详情

# bookingCustomerInfo
source: Information
zh: 信息

# instagramLabel
source: Instagram
ko: 인스타그램

# zaloLabel
source: Zalo
ko: 자로

# shippingFeeAmountPositive
source: +{amount} VND
vi: +{amount} VNĐ
